In [1]:
import os
import django
os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'rest.settings')
os.environ["DJANGO_ALLOW_ASYNC_UNSAFE"] = "true"
django.setup()

In [2]:
Car.objects.all()

In [3]:
for i in Car.objects.all():
    print(i)

1 Mitsubishi L200
2 Mini Cooper
3 TVR Tuscan
4 BMW Z3
5 Toyota Celica

In [4]:
import pandas as pd
df = pd.DataFrame(list(Car.objects.all().values()))
df

   id       maker   model     price      color        date
0   1  Mitsubishi    L200   9995.00        red  2022-01-21
1   2        Mini  Cooper  12500.00        red  2022-01-21
2   3         TVR  Tuscan  18000.00       blue  2022-01-21
3   4         BMW      Z3  13995.00     silver  2022-01-21
4   5      Toyota  Celica   4665.00  dark blue  2022-01-21

In [5]:
pd.DataFrame(list(Client.objects.all().values()))

,id,name,address,postcode,email,phone
0,1,Bampenporn,pathumthani,12120,bampenporn.son@dome.tu.ac.th,0981768521
1,2,Eistein,bangkok,10110,eistein@email.com,0999999999
2,3,David,chon buri,20000,david@gmail.com,0888888888

In [6]:
pd.DataFrame(list(Rent.objects.all().values()))

   id  car_id  client_id   rent_date return_date     cost
0   1       4          1  2022-01-21  2022-01-31   189.00
1   2       2          2  2022-01-21  2022-01-26  1050.00
2   3       3          3  2022-01-21  2022-02-02  1310.00

In [37]:
#q1 มีการเช่าครั้งไหนบ้างที่ราคารถมากกว่าหรือเท่ากับ 15000
pd.DataFrame(list( Rent.objects.filter(car__price__gt=10000).values() ))

   id  car_id  client_id   rent_date return_date     cost
0   1       4          1  2022-01-21  2022-01-31   189.00
1   2       2          2  2022-01-21  2022-01-26  1050.00
2   3       3          3  2022-01-21  2022-02-02  1310.00

In [34]:
#q2 มีลูกค้าคนไหนบ้างที่เช่ารถ โดยรถนั้นราคามากกว่าหรือเท่ากับ 10000
query_set=Client.objects.filter(rent__car__price__gt=10000).values()
pd.DataFrame(list(query_set))

,id,name,address,postcode,email,phone
0,1,Bampenporn,pathumthani,12120,bampenporn.son@dome.tu.ac.th,0981768521
1,2,Eistein,bangkok,10110,eistein@email.com,0999999999
2,3,David,chon buri,20000,david@gmail.com,0888888888

In [36]:
print(Client.objects.filter(rent__car__price__gt=10000).values().query)

SELECT "myapp_client"."id", "myapp_client"."name", "myapp_client"."address", "myapp_client"."postcode", "myapp_client"."email", "myapp_client"."phone" FROM "myapp_client" INNER JOIN "myapp_rent" ON ("myapp_client"."id" = "myapp_rent"."client_id") INNER JOIN "myapp_car" ON ("myapp_rent"."car_id" = "myapp_car"."id") WHERE "myapp_car"."price" > 10000

In [35]:
#q3 มีรถคันไหนบ้างที่ยืมโดย bampenporn และรถราคาน้อยกว่า 10000
pd.DataFrame(list(Car.objects.filter(rent__car__price__gt=10000,rent__client__name='Bampenporn').values()))

   id maker model     price   color        date
0   4   BMW    Z3  13995.00  silver  2022-01-21